package com.example.schedule

import android.icu.util.Calendar

class ScheduleData {
    val firstWeekSchedules = listOf(
        DaySchedule("Понедельник", listOf(
            Schedule(1, "Базы данных", "18:20", "19:50", "А-17", "Барабанщиков"),
            Schedule(2, "Базы данных", "19:55", "21:25", "132", "Барабанщиков")
        )),
        DaySchedule("Вторник", listOf(
            Schedule(3, "Управление IT проектами", "18:20", "19:50", "А-21", "Воробьев, Пущев"),
            Schedule(4, "Управление IT проектами", "19:55", "21:25", "А-21", "Воробьев, Пущев")
        )),
        DaySchedule("Среда", listOf(
            Schedule(5, "Нет пар", "", "", "", "")
        )),
        DaySchedule("Четверг", listOf(
            Schedule(6, "Разработка интернет-приложений", "19:30", "19:50", "132", "Павличенко"),
            Schedule(7, "Разработка интернет-приложений", "19:55", "21:25", "132", "Павличенко")
        )),
        DaySchedule("Пятница", listOf(
            Schedule(8, "Экономика", "13:15", "14:45", "215", "Ткач"),
            Schedule(9, "Экономика", "15:00", "16:30", "120", "Ткач"),
            Schedule(10, "Экономика", "16:40", "18:10", "120", "Ткач")
        )),
        DaySchedule("Суббота", listOf(
            Schedule(11, "Тестирование ПО", "11:20", "12:50", "132", "Булавин"),
            Schedule(12, "Тестирование ПО", "13:15", "14:45", "132", "Булавин"),
            Schedule(13, "Технологии прикладного программирования", "15:00", "16:30", "326", "Веригин"),
            Schedule(14, "Технологии прикладного программирования", "16:40", "18:10", "326", "Веригин")
        )),
        DaySchedule("Воскресенье", listOf(
            Schedule(15, "Нет пар", "", "", "", "")
        ))
    )

    val secondWeekSchedules = listOf(
        DaySchedule("Понедельник", listOf(
            Schedule(1, "Анализ данных", "16:40", "18:10", "А-17", "Мирасов"),
            Schedule(2, "Базы данных", "18:20", "19:50", "А-17", "Барабанщиков")
        )),
        DaySchedule("Вторник", listOf(
            Schedule(3, "Управление IT проектами", "18:20", "19:50", "А-21", "Воробьев, Пущев"),
            Schedule(4, "Управление IT проектами", "19:55", "21:25", "А-21", "Воробьев, Пущев")
        )),
        DaySchedule("Среда", listOf(
            Schedule(5, "Базы данных", "18:20", "19:50", "А-17", "Барабанщиков"),
            Schedule(6, "Базы данных", "19:55", "21:25", "132", "Барабанщиков")
        )),
        DaySchedule("Четверг", listOf(
            Schedule(7, "Разработка интернет-приложений", "19:30", "19:50", "132", "Павличенко"),
            Schedule(8, "Разработка интернет-приложений", "19:55", "21:25", "132", "Павличенко")
        )),
        DaySchedule("Пятница", listOf(
            Schedule(9, "Анализ данных", "15:00", "16:30", "120", "Мирасов"),
            Schedule(10, "Анализ данных", "16:40", "18:10", "120", "Мирасов")
        )),
        DaySchedule("Суббота", listOf(
            Schedule(11, "Тестирование ПО", "11:20", "12:50", "132", "Булавин"),
            Schedule(12, "Тестирование ПО", "13:15", "14:45", "132", "Булавин"),
            Schedule(13, "Технологии прикладного программирования", "15:00", "16:30", "326", "Веригин"),
            Schedule(14, "Технологии прикладного программирования", "16:40", "18:10", "326", "Веригин")
        )),
        DaySchedule("Воскресенье", listOf(
            Schedule(15, "Нет пар", "", "", "", "")
        ))
    )

    fun getLessonToday(): List<DaySchedule> {
        val numberWeek = (Calendar.getInstance().get(Calendar.WEEK_OF_YEAR) + 1) % 2
        return when (numberWeek){
            1 -> firstWeekSchedules
            else -> secondWeekSchedules
        }
    }
}